---
kind: type
id: T:Autodesk.Revit.DB.FreeFormElement
source: html/27b9411a-d368-1541-b7db-b5157a58c581.htm
---
# Autodesk.Revit.DB.FreeFormElement

A Free Form Element that contains non-parametric geometry created from an input solid outline.

## Syntax (C#)
```csharp
public class FreeFormElement : GenericForm
```

## Remarks
The element can participate in joins and void cuts with other combinable elements.